app/controllers/audit_logs_controller.rb

SELECT  "audit_logs".* FROM "audit_logs" LIMIT $1 OFFSET $2  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "audit_logs"
---
  def index
    @audit_logs = AuditLog.all.page(params[:page]).per(15)