app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
---
  def index
    @posts = Post.posts_by(current_user).page(params[:page]).per(15)

INSERT INTO "posts" ("date", "rationale", "created_at", "updated_at", "user_id", "overtime_request") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "2019-08-24"], ["rationale", "asdasdas"], ["created_at", "2019-08-29 09:13:48.995077"], ["updated_at", "2019-08-29 09:13:48.995077"], ["user_id", 1], ["overtime_request", "1.0"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save

UPDATE "posts" SET "rationale" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["rationale", "1 r"], ["updated_at", "2019-08-28 05:48:11.100514"], ["id", 2]]
---
  def update
    authorize @post # pundit thing
    if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
  def destroy
    if @post.destroy