app/controllers/static_controller.rb

  def homepage
    if admin_types.include?(current_user.try(:type))
      @pending_approvals = Post.where(status: 'submitted')
---
SELECT "posts".* FROM "posts" WHERE "posts"."status" = $1  [["status", 0]]